import Image from "next/image";
import consulting from "@/public/consulting.jpg";
import ardeutika from "@/public/ardeutika.jpg";
import garden_con from "@/public/garden_con.jpg";

export const metadata = {
  title: "Υπηρεσίες",
};

export default function Page() {
  return (
    <div className="grid grid-cols-5 gap-x-24 gap-y-32 text-lg items-center">
      {/* 1st */}
      <div className="col-span-3">
        <h1 className="text-2xl mb-10 text-accent-500 font-medium">
          Γεωπονικές Μελέτες
        </h1>

        <div>
          <p>
            Με πολυετή εμπειρία στον αγροτικό τομέα, προσφέρουμε εξατομικευμένη
            υποστήριξη τόσο σε επαγγελματίες όσο και σε ερασιτέχνες αγρότες,
            βοηθώντας τους να επιτύχουν τους στόχους τους αποτελεσματικά και
            οικονομικά. Η προσέγγισή μας δίνει έμφαση στις σύγχρονες, βιώσιμες
            γεωργικές πρακτικές και στη βαθιά δέσμευση για την προστασία του
            περιβάλλοντος — εξασφαλίζοντας μακροχρόνια παραγωγικότητα με
            ελάχιστο οικολογικό αποτύπωμα.
          </p>
        </div>
      </div>
      <div className="col-span-2">
        <Image
          src={consulting}
          alt="Agricultural consulting"
          placeholder="blur"
        />
      </div>

      {/*  2nd */}
      <div className=" relative col-span-2">
        <Image src={garden_con} alt="Garden construction" placeholder="blur" />
      </div>
      <div className="col-span-3">
        <h1 className="text-2xl mb-10 text-accent-500 font-medium">
          Κατασκευές Κήπων
        </h1>

        <div className="space-y-8">
          <p>
            Με πάθος και αφοσίωση, συνεργαζόμαστε μαζί σας για να δημιουργήσουμε
            πράσινους χώρους υψηλής αισθητικής αξίας, προσαρμοσμένους στις
            ανάγκες σας και βασισμένους σε σύγχρονες τεχνικές αρχιτεκτονικής
            τοπίου. Είμαστε εδώ για να σας βοηθήσουμε να σχεδιάσετε και να
            κατασκευάσετε το πράσινο περιβάλλον του σπιτιού ή του επαγγελματικού
            σας χώρου. Όλα τα υλικά που χρησιμοποιούνται είναι επώνυμα, από
            γνωστούς κατασκευαστές, και συνοδεύονται από εγγύηση ποιότητας.
          </p>
        </div>
      </div>

      {/* 3rd */}
      <div className="col-span-3">
        <h1 className="text-2xl mb-10 text-accent-500 font-medium">
          Αρδευτικά Δίκτυα
        </h1>

        <div>
          <p>
            Αναλαμβάνουμε τον πλήρη σχεδιασμό, την εγκατάσταση και τη διαχείριση
            υπόγειων και υπέργειων αρδευτικών δικτύων, προσαρμοσμένων στις
            ιδιαίτερες ανάγκες των καλλιεργειών ή του τοπίου σας. Οι υπηρεσίες
            μας περιλαμβάνουν την εγκατάσταση αποδοτικών κεντρικών συστημάτων
            ελέγχου, εξασφαλίζοντας βέλτιστη κατανομή του νερού, μείωση της
            σπατάλης και μακροχρόνια βιωσιμότητα. Είτε πρόκειται για οικιακούς
            κήπους, γεωργικές εκτάσεις ή επαγγελματικούς πράσινους χώρους,
            προσφέρουμε αξιόπιστες, αυτοματοποιημένες λύσεις, χρησιμοποιώντας
            υλικά υψηλής ποιότητας και την πιο σύγχρονη τεχνολογία άρδευσης.
          </p>
        </div>
      </div>

      {/* 4th */}
      <div className="col-span-2">
        <Image src={ardeutika} alt="Irrigation systems" placeholder="blur" />
      </div>
      <div className=" relative aspect-square col-span-2">
        <Image
          src="/ydroponia.jpg"
          fill
          alt="Hydroponic cultivation"
          className="object-cover"
        />
      </div>
      <div className="col-span-3">
        <h1 className="text-2xl mb-10 text-accent-500 font-medium">
          Υδροπονική Καλλιέργια
        </h1>

        <div className="space-y-8">
          <p>
            Η υδροπονία είναι η πλέον τεχνολογικά προηγμένη μέθοδος
            καλλιέργειας, που απαιτεί υψηλότερο επίπεδο εξοπλισμού και
            εξειδίκευσης από τον καλλιεργητή. Τα υδροπονικά συστήματα προσφέρουν
            υψηλή απόδοση ανά μονάδα επιφάνειας, μειωμένο κόστος παραγωγής και
            ανταγωνιστικά προϊόντα σταθερής, υψηλής ποιότητας. Από το κατάστημά
            μας μπορείτε να βρείτε υδροπονικές κεφαλές, υποστρώματα, συστήματα
            αποστράγγισης, δίκτυα άρδευσης και όλα τα απαραίτητα είδη που
            σχετίζονται με την υδροπονική καλλιέργεια.
          </p>
        </div>
      </div>
    </div>
  );
}
